---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.SteelElemPatternTotalLength
source: html/89fced22-a3f1-42ef-d928-b912f2eaa8a5.htm
---
# Autodesk.Revit.DB.ParameterTypeId.SteelElemPatternTotalLength Property

"Length on side 1"

## Syntax (C#)
```csharp
public static ForgeTypeId SteelElemPatternTotalLength { get; }
```